app/views/restaurants/index.html.haml

    =link_to "Review #{restaurant.name}", new_restaurant_review_path(restaurant.id)
    -if restaurant.reviews.any?
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1 ORDER BY "reviews"."id" ASC LIMIT $2  [["restaurant_id", 11], ["LIMIT", 1]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT $2  [["restaurant_id", 21], ["LIMIT", 1]]