app/controllers/reviews_controller.rb

  def new
    @restaurant = Restaurant.find params[:restaurant_id]
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def create
    @restaurant = Restaurant.find params[:restaurant_id]
    @review = @restaurant.build_review review_params, current_user

    if @review.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "created_at", "updated_at", "restaurant_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["thoughts", "so-so"], ["rating", 3], ["created_at", 2017-01-11 10:01:36 UTC], ["updated_at", 2017-01-11 10:01:36 UTC], ["restaurant_id", 5]]